# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:

* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='https://curriculum-content.s3.amazonaws.com/data-science/images/Database-Schema.png' width="600">

## Connect to the Database

Include the relevant imports, then connect to the database located at `data.sqlite`.

In [1]:
# Your code here
import sqlite3
import pandas as pd

# Connect to the SQLite database
connection = sqlite3.connect('data.sqlite')

## Employees and Their Offices (a One-to-One Join)

Select all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [2]:
# Your code here
# Define the SQL query
query = """
SELECT employees.firstName, employees.lastName, offices.city, offices.state
FROM employees
LEFT JOIN offices ON employees.officeCode = offices.officeCode
ORDER BY employees.firstName, employees.lastName
"""

# Execute the query and load the results into a DataFrame
employees_offices_df = pd.read_sql(query, connection)

# Display the DataFrame
print(employees_offices_df)

   firstName   lastName           city       state
0       Andy     Fixter         Sydney
1    Anthony        Bow  San Francisco          CA
2      Barry      Jones         London
3      Diane     Murphy  San Francisco          CA
4   Foon Yue      Tseng            NYC          NY
5     George     Vanauf            NYC          NY
6     Gerard     Bondur          Paris
7     Gerard  Hernandez          Paris
8       Jeff   Firrelli  San Francisco          CA
9      Julie   Firrelli         Boston          MA
10     Larry       Bott         London
11    Leslie   Jennings  San Francisco          CA
12    Leslie   Thompson  San Francisco          CA
13      Loui     Bondur          Paris
14      Mami      Nishi          Tokyo  Chiyoda-Ku
15    Martin     Gerard          Paris
16      Mary  Patterson  San Francisco          CA
17    Pamela   Castillo          Paris
18     Peter      Marsh         Sydney
19     Steve  Patterson         Boston          MA
20       Tom       King         Sydney
21   William  Patterson         Sydney
22   Yoshimi       Kato          Tokyo  Chiyoda-Ku

## Customers and Their Orders (a One-to-Many Join)

Select all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [3]:
# Your code here
# Define the SQL query
query = """
SELECT customers.contactFirstName, customers.contactLastName, orders.orderNumber, orders.orderDate, orders.status
FROM customers
JOIN orders ON customers.customerNumber = orders.customerNumber
ORDER BY customers.contactLastName, customers.contactFirstName, orders.orderDate
"""

# Execute the query and load the results into a DataFrame
customers_orders_df = pd.read_sql(query, connection)

# Display the DataFrame
print(customers_orders_df)

    contactFirstName contactLastName  orderNumber   orderDate    status
0             Paolo          Accorti        10280  2004-08-17   Shipped
1             Paolo          Accorti        10293  2004-09-09   Shipped
2             Rachel        Ashworth        10110  2003-03-18   Shipped
3             Rachel        Ashworth        10306  2004-10-14   Shipped
4             Rachel        Ashworth        10332  2004-11-17   Shipped
..               ...             ...          ...         ...       ...
321            Julie           Young        10145  2003-08-25   Shipped
322            Julie           Young        10189  2003-11-18   Shipped
323            Julie           Young        10367  2005-01-12  Resolved
324             Mary           Young        10154  2003-10-02   Shipped
325             Mary           Young        10376  2005-02-08   Shipped

[326 rows x 5 columns]

## Customers and Their Payments (Another One-to-Many Join)

Select all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [4]:
# Your code here
# Define the SQL query
query = """
SELECT customers.contactFirstName, customers.contactLastName, payments.amount, payments.paymentDate
FROM customers
JOIN payments ON customers.customerNumber = payments.customerNumber
ORDER BY payments.amount DESC
"""

# Execute the query and load the results into a DataFrame
customers_payments_df = pd.read_sql(query, connection)

# Display the DataFrame
print(customers_payments_df)

    contactFirstName contactLastName     amount paymentDate
0             Diego           Freyre  120166.58  2005-03-18
1             Diego           Freyre  116208.40  2004-12-31
2              Susan          Nelson  111654.40  2003-08-15
3               Eric       Natividad  105743.00  2003-12-26
4              Susan          Nelson  101244.59  2005-03-05
..               ...             ...        ...         ...
268          Carine          Schmitt    1676.14  2004-12-18
269         Pascale         Cartrain    1627.56  2003-04-19
270           Jonas       Bergulfsen    1491.38  2003-10-28
271         Pascale         Cartrain    1128.20  2003-08-22
272            Akiko       Shimamura     615.45  2005-05-18

[273 rows x 4 columns]

## Orders, Order Details, and Product Details (a Many-to-Many Join)

Select all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [5]:
# Your code here
# Define the SQL query
query = """
SELECT orders.orderNumber, orders.orderDate, orders.status, 
       orderdetails.productCode, orderdetails.quantityOrdered, orderdetails.priceEach, 
       products.productName, products.productLine, products.productScale, products.productVendor
FROM orders
JOIN orderdetails ON orders.orderNumber = orderdetails.orderNumber
JOIN products ON orderdetails.productCode = products.productCode
ORDER BY orders.orderNumber, products.productName
"""

# Execute the query and load the results into a DataFrame
orders_details_products_df = pd.read_sql(query, connection)

# Display the DataFrame
print(orders_details_products_df)

      orderNumber   orderDate      status productCode  quantityOrdered  \
0           10100  2003-01-06     Shipped    S18_2248               50
1           10100  2003-01-06     Shipped    S18_1749               30
2           10100  2003-01-06     Shipped    S18_4409               22
3           10100  2003-01-06     Shipped    S24_3969               49
4           10101  2003-01-09     Shipped    S18_2795               26
...           ...         ...         ...         ...              ...
2991        10425  2005-05-31  In Process    S24_1444               55
2992        10425  2005-05-31  In Process    S32_1268               41
2993        10425  2005-05-31  In Process    S18_3232               28
2994        10425  2005-05-31  In Process    S18_2238               28
2995        10425  2005-05-31  In Process    S50_1392               18

      priceEach                          productName       productLine  \
0         55.09                   1911 Ford Town Car      Vintage Cars
1        136.00             1917 Grand Touring Sedan      Vintage Cars
2         75.46  1932 Alfa Romeo 8C2300 Spider Sport      Vintage Cars
3         35.29     1936 Mercedes Benz 500k Roadster      Vintage Cars
4        167.06               1928 Mercedes-Benz SSK      Vintage Cars
...         ...                                  ...               ...
2991      53.75                   1970 Dodge Coronet      Classic Cars
2992      83.79          1980’s GM Manhattan Express  Trucks and Buses
2993     140.55          1992 Ferrari 360 Spider red      Classic Cars
2994     147.36       1998 Chrysler Plymouth Prowler      Classic Cars
2995      94.92     Diamond T620 Semi-Skirted Tanker  Trucks and Buses

     productScale              productVendor
0            1:18    Motor City Art Classics
1            1:18  Welly Diecast Productions
2            1:18              Exoto Designs
3            1:24          Red Start Diecast
4            1:18       Gearbox Collectibles
...           ...                        ...
2991         1:24   Highway 66 Mini Classics
2992         1:32    Motor City Art Classics
2993         1:18       Unimax Art Galleries
2994         1:18       Gearbox Collectibles
2995         1:50   Highway 66 Mini Classics

[2996 rows x 10 columns]

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!